app/Controllers/AuthController.php

    public function login()
    {
        $session = session();
        $model = new UsersModel();

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password_hash');

        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admingudang@email.com'
 LIMIT 1