app/Controllers/BarangController.php

SELECT *
FROM `satuan_barang`
SELECT *
FROM `kategori_barang`
SELECT *
FROM `barang`
---
    public function index()
    {
        $data['satuan_barang'] = $this->SatuanBarangModel->findAll();
        $data['kategori_barang'] = $this->KategoriBarangModel->findAll();

        $data['barang_control'] = array_map(function ($barang) {
            $barang['harga_jual'] = number_format($barang['harga_jual'], 0, ',', '.');
            $barang['harga_beli'] = number_format($barang['harga_beli'], 0, ',', '.');
            return $barang;
        }, $this->BarangModel->findAll());

        // Mengambil semua laporan barang
        $barang_control = $this->BarangModel->findAll();

        // Mengambil semua satuan barang
        $satuan_barang = $this->SatuanBarangModel->findAll();

        // Membuat array untuk lookup nama satuan berdasarkan ID
        $satuan_lookup = [];
        foreach ($satuan_barang as $satuan) {
            $satuan_lookup[$satuan['id']] = $satuan['nama_satuan'];
        }

        // Mengambil semua kategori barang
        $kategori_barang = $this->KategoriBarangModel->findAll();

SELECT *
FROM `users`
WHERE `users`.`user_id` = '3'
---

        // Ambil data pengguna dari session
        $userId = $this->session->get('user_id');
        $user = $this->UsersModel->find($userId);

SELECT *
FROM `barang`
WHERE `barang`.`id` = '1'
SELECT *
FROM `satuan_barang`
WHERE `satuan_barang`.`id` = '1'
SELECT *
FROM `kategori_barang`
WHERE `kategori_barang`.`id` = '1'
---
    public function detail($id = null)
    {
        $barangModel = new BarangModel();
        $barang = $barangModel->find($id); // Mengambil data barang berdasarkan ID

        $BarangModel = new BarangModel();
        $jenisBarang = $BarangModel->getJenisBarang();

        $kategoriBarang = $BarangModel->getJenisKategori();
        $satuanBarangModel = new SatuanBarangModel();
        $kategoriBarangModel = new KategoriBarangModel();
        // Periksa apakah ID diberikan
        if ($id === null) {
            return redirect()->back()->with('error', 'ID tidak ditemukan.');
        }

        // Ambil data satuan berdasarkan ID
        $satuan = $satuanBarangModel->find($id);
        $kategori = $kategoriBarangModel->find($id);