app/Controllers/DashboardController.php

SELECT *
FROM `users`
WHERE `users`.`user_id` = '3'
SELECT *
FROM `barang`
SELECT *
FROM `users`
SELECT *
FROM `barang_masuk`
SELECT *
FROM `barang`
WHERE `kode_barang` = 'BRG0001'
 LIMIT 1
SELECT *
FROM `barang_keluar`
SELECT *
FROM `barang`
WHERE `kode_barang` = 'BRG0002'
 LIMIT 1
---
    public function index()
    {

        // Ambil data pengguna dari session
        $userId = $this->session->get('user_id');
        $user = $this->UsersModel->find($userId);

        // Mengambil semua laporan barang
        $barang_control = $this->BarangModel->findAll();
        // Menghitung total barang masuk
        $totalBarang = count($barang_control);

        // Kategori
        $total_kategori = $this->KategoriBarangModel->getTotalKategori();

        $users = $this->UsersModel->findAll();

        // Menghitung total barang masuk
        $barangMasukData = $this->BarangMasukModel->findAll();
        $barangMasuk = [];
        foreach ($barangMasukData as $data) {
            $barang = $this->BarangModel->where('kode_barang', $data['kode_barang'])->first();
            $data['nama_barang'] = $barang ? $barang['nama_barang'] : 'Tidak Ditemukan';
            $barangMasuk[] = $data;
        }
        $totalBarangMasuk = count($barangMasuk);

        // Menghitung total barang keluar
        $data['total_bk'] = $this->BarangKeluarModel->getTotal();
        $barangKeluarData = $this->BarangKeluarModel->findAll();
        $barangKeluar = [];

        foreach ($barangKeluarData as $data) {
            $barang = $this->BarangModel->where('kode_barang', $data['kode_barang'])->first();

SELECT *
FROM `satuan_barang`
---
        }
        $totalbarangKeluar = count($barangKeluar);

        $satuanbarang = $this->SatuanBarangModel->findAll();