app/Controllers/LaporanBarangMasuk.php

    public function index()
    {
        $barangMasukData = $this->barangMasukModel->findAll();
        $barangMasuk = [];

        foreach ($barangMasukData as $data) {
            $barang = $this->BarangModel->where('kode_barang', $data['kode_barang'])->first();
            $data['nama_barang'] = $barang ? $barang['nama_barang'] : 'Tidak Ditemukan';
            $barangMasuk[] = $data;
        }

        $data['satuan_barang'] = $this->SatuanBarangModel->findAll();

        // Mengambil semua laporan barang
        $barang_control = $this->BarangModel->findAll();

        // Mengambil semua satuan barang
        $satuan_barang = $this->SatuanBarangModel->findAll();
---
SELECT *
FROM `barang_masuk`
SELECT *
FROM `barang`
WHERE `kode_barang` = 'BRG0001'
 LIMIT 1
SELECT *
FROM `satuan_barang`
SELECT *
FROM `barang`


        // Ambil data pengguna dari session
        $userId = $this->session->get('user_id');
        $user = $this->UsersModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = '4'