app/Controllers/LaporanBarangKeluar.php

    public function index()
    {
        $data['total_bk'] = $this->BarangKeluarModel->getTotal();
        $kodeTransaksi = $this->generateKodeTransaksi(date('Y-m-d'));

        $data['satuan_barang'] = $this->SatuanBarangModel->findAll();
        $data['barang_control'] = array_map(function ($barang) {
            $barang['harga_jual'] = number_format($barang['harga_jual'], 0, ',', '.');
            $barang['harga_beli'] = number_format($barang['harga_beli'], 0, ',', '.');
            return $barang;
        }, $this->BarangModel->findAll());

        // Mengambil semua laporan barang
        $barang_control = $this->BarangModel->findAll();

        // Mengambil semua satuan barang
        $satuan_barang = $this->SatuanBarangModel->findAll();

        // Membuat array untuk lookup nama satuan berdasarkan ID
        $satuan_lookup = [];
        foreach ($satuan_barang as $satuan) {
            $satuan_lookup[$satuan['id']] = $satuan['nama_satuan'];
        }

        // Menggabungkan data laporan barang dengan nama satuan
        foreach ($barang_control as &$barang) {
            $barang['nama_satuan'] = isset($satuan_lookup[$barang['jenis_satuan']]) ? $satuan_lookup[$barang['jenis_satuan']] : 'Tidak Ditemukan';
        }
        $barangKeluarData = $this->BarangKeluarModel->findAll();
        $barangKeluar = [];

        foreach ($barangKeluarData as $data) {
            $barang = $this->BarangModel->where('kode_barang', $data['kode_barang'])->first();
---
SELECT *
FROM `satuan_barang`
SELECT *
FROM `barang`
SELECT *
FROM `barang_keluar`
SELECT *
FROM `barang`
WHERE `kode_barang` = 'BRG0002'
 LIMIT 1


        // Ambil data pengguna dari session
        $userId = $this->session->get('user_id');
        $user = $this->UsersModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = '4'

    private function generateKodeTransaksi($tanggal)
    {
        // Ambil tahun dari tanggal
        $tahun = date('Y', strtotime($tanggal));

        // Cari transaksi terakhir dengan format yang sama di tahun yang sama
        $lastTransaction = $this->BarangKeluarModel
            ->where('kode_transaksi LIKE', 'TRX-OUT-%-' . $tahun)
            ->orderBy('id', 'DESC')
            ->first();
---
SELECT *
FROM `barang_keluar`
WHERE `kode_transaksi` LIKE 'TRX-OUT-%-2024'
ORDER BY `id` DESC
 LIMIT 1