app/Controllers/LaporanStok.php

    public function index()
    {
        $bulan = $this->request->getGet('bulan');
        $data['satuan_barang'] = $this->SatuanBarangModel->findAll();

        $data['barang_control'] = array_map(function ($barang) {
            $barang['harga_jual'] = number_format($barang['harga_jual'], 0, ',', '.');
            $barang['harga_beli'] = number_format($barang['harga_beli'], 0, ',', '.');
            return $barang;
        }, $this->BarangModel->findAll());

        // Mengambil semua laporan barang
        $barang_control = $this->BarangModel->findAll();

        // Mengambil semua satuan barang
        $satuan_barang = $this->SatuanBarangModel->findAll();
---
SELECT *
FROM `satuan_barang`
SELECT *
FROM `barang`


        // Ambil data pengguna dari session
        $userId = $this->session->get('user_id');
        $user = $this->UsersModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = '4'

    public function detail($id)
    {
        $barang = $this->BarangModel->find($id);
        $kategoriBarang = $this->KategoriBarangModel->findAll();

        if (!$barang) {
            session()->setFlashdata('error', 'Data barang tidak ditemukan.');
            return redirect()->to(base_url('laporan-stok'));
        }

        $jenisBarang = $this->SatuanBarangModel->findAll();
---
SELECT *
FROM `barang`
WHERE `barang`.`id` = '2'
SELECT *
FROM `kategori_barang`
SELECT *
FROM `satuan_barang`