app/Controllers/TransaksiBarangMasuk.php

SELECT *
FROM `barang_masuk`
SELECT *
FROM `barang`
WHERE `kode_barang` = 'BRG0001'
 LIMIT 1
SELECT *
FROM `users`
WHERE `users`.`user_id` = '3'
---
    public function index()
    {
        $data['total_bm'] = $this->barangMasukModel->getTotal();

        $barangMasukData = $this->barangMasukModel->findAll();
        $barangMasuk = [];
        foreach ($barangMasukData as $data) {
            $barang = $this->barangModel->where('kode_barang', $data['kode_barang'])->first();
            $data['nama_barang'] = $barang ? $barang['nama_barang'] : 'Tidak Ditemukan';
            $barangMasuk[] = $data;
        }

        // Menghitung total barang masuk
        $totalBarangMasuk = count($barangMasuk);

        // Ambil data pengguna dari session
        $userId = $this->session->get('user_id');
        $user = $this->UsersModel->find($userId);