app/Models/BarangMasukModel.php

    public function getTotal()
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `barang_masuk`