app/Models/BarangKeluarModel.php

    public function getTotal()
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `barang_keluar`