app/Models/BarangModel.php

    public function getJenisBarang()
    {
        $db = \Config\Database::connect();
        $query = $db->table('satuan_barang');
        $result = $query->get()->getResultArray();
---
SELECT *
FROM `satuan_barang`

    public function getJenisKategori()
    {
        $db = \Config\Database::connect();
        $query = $db->table('kategori_barang');
        $result = $query->get()->getResultArray();
---
SELECT *
FROM `kategori_barang`