app/Models/KategoriBarangModel.php

SELECT COUNT(*) AS `numrows`
FROM `kategori_barang`
---
    public function getTotalKategori()
    {
        return $this->countAllResults();